---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarShapeDefinition.Complete
source: html/570cadd6-28ca-7828-dd6a-0e4bcb53256a.htm
---
# Autodesk.Revit.DB.Structure.RebarShapeDefinition.Complete Property

Report whether the shape definition is fully
 constrained.

## Syntax (C#)
```csharp
public bool Complete { get; }
```